/*
 * @Author: truxcoder
 * @Date: 2021-12-29 09:49:12
 * @LastEditTime: 2021-12-29 10:13:29
 * @LastEditors: truxcoder
 * @Description: 定义各类字典
 */

export const nationDict = [
  '汉族',
  '蒙古族',
  '回族',
  '藏族',
  '维吾尔族',
  '苗族',
  '彝族',
  '壮族',
  '布依族',
  '朝鲜族',
  '满族',
  '侗族',
  '瑶族',
  '白族',
  '土家族',
  '哈尼族',
  '哈萨克族',
  '傣族',
  '黎族',
  '僳僳族',
  '佤族',
  '畲族',
  '高山族',
  '拉祜族',
  '水族',
  '东乡族',
  '纳西族',
  '景颇族',
  '柯尔克孜族',
  '土族',
  '达斡尔族',
  '仫佬族',
  '羌族',
  '布朗族',
  '撒拉族',
  '毛南族',
  '仡佬族',
  '锡伯族',
  '阿昌族',
  '普米族',
  '塔吉克族',
  '怒族',
  '乌孜别克族',
  '俄罗斯族',
  '鄂温克族',
  '德昂族',
  '保安族',
  '裕固族',
  '京族',
  '塔塔尔族',
  '独龙族',
  '鄂伦春族',
  '赫哲族',
  '门巴族',
  '珞巴族',
  '基诺族'
]

export const politicalDict = ['中共党员', '共青团员', '群众']
export const proCertDict = ['律师资格证', '三级心理咨询师', '二级心理咨询师', '一级建造师', '软件架构师', '教师资格证']
export const fullTimeEduDict = ['博士研究生', '硕士研究生', '博士', '硕士', '大学本科学士', '大学本科', '大学专科', '中专', '中技', '高中', '初中']
export const partTimeEduDict = [
  '在职博士研究生',
  '在职硕士研究生',
  '在职大学',
  '在职大专',
  '成人教育大学',
  '成人教育大专',
  '省委党校硕士研究生',
  '省委党校大学',
  '省委党校大专',
  '中央党校博士研究生',
  '中央党校硕士研究生',
  '中央党校大学'
]
export const subjectDict = ['法学', '新闻学', '监狱学', '汉语言文学', '经济学', '化学', '数学', '心理学', '物理', '医学']
